In [5]:
# Set of numbers from 1 to 20
numbers = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20}

This is a set. Similar to a dictionary. It uses the same curly bracket.
This line of code has created the numbers set.

In [6]:
# Problem 1: Select all even numbers
even_numbers = set()
for number in numbers:
    if number % 2 == 0:
        even_numbers.add(number)
print("Set of even_numbers =", even_numbers)

Set of even_numbers = {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}

In [9]:
# Problem 2: Select all odd numbers
odd_numbers = set()
for number in numbers:
    if number % 2 != 0:
        odd_numbers.add(number)
print("Set of odd_numbers =", odd_numbers)

Set of odd_numbers = {1, 3, 5, 7, 9, 11, 13, 15, 17, 19}

In [12]:
# Problem 3: Select all numbers above 14
above_14 = set()
for number in numbers:
    if number > 14:
        above_14.add(number)




print("Set of numbers above_14 =", above_14)

Set of numbers above_14 = {15, 16, 17, 18, 19, 20}

In [13]:
# Problem 4: Select all numbers below 5
below_5 = set()
for number in numbers:
    if number < 5:
        below_5.add(number)


print("Set of numbers below_5 =", below_5)

Set of numbers below_5 = {1, 2, 3, 4}

In [15]:
# Problem 5: Select all even numbers above 15
even_above_15 = set()
for number in numbers:
    if (number > 15) & (number % 2 == 0):
        even_above_15.add(number)



print("Set of numbersthat are even_above_15 =", even_above_15)

Set of numbersthat are even_above_15 = {16, 18, 20}

In [16]:
# Bonus Problem: Select all odd numbers between 3 and 12 (inclusive)
odd_between_3_and_12 = set()
for number in numbers:
    if (number > 3) & (number < 15) & (number % 2 != 0):
    # if number > 3 and number < 15 and number % 2 != 0:
        odd_between_3_and_12.add(number)

print("Set of numbers that are odd_between_3_and_12 ) =", odd_between_3_and_12)

Set of numbers that are odd_between_3_and_12 ) = {5, 7, 9, 11, 13}

# SET THEORY & DATAFRAME MERGING

In [17]:
import pandas as pd

In [18]:
customers = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Email': ['alice@example.com', 'bob@example.com', 'charlie@example.com', 'david@example.com']
})

orders = pd.DataFrame({
    'OrderID': [101, 102, 103, 104],
    'CustomerID': [1, 2, 1, 3],
    'Product': ['Widget', 'Gadget', 'Widget', 'Widget'],
    'Quantity': [3, 2, 5, 4]
})

In [19]:
customers

   CustomerID     Name                Email
0           1    Alice    alice@example.com
1           2      Bob      bob@example.com
2           3  Charlie  charlie@example.com
3           4    David    david@example.com

In [20]:
orders

   OrderID  CustomerID Product  Quantity
0      101           1  Widget         3
1      102           2  Gadget         2
2      103           1  Widget         5
3      104           3  Widget         4

In [21]:
# Exercise 1: Inner Join (Intersection of 2 sets)
inner_join_result = pd.merge(customers, orders, on='CustomerID', how='inner')


inner_join_result

   CustomerID     Name                Email  OrderID Product  Quantity
0           1    Alice    alice@example.com      101  Widget         3
1           1    Alice    alice@example.com      103  Widget         5
2           2      Bob      bob@example.com      102  Gadget         2
3           3  Charlie  charlie@example.com      104  Widget         4

<p style="font-size:14px;">When you combine them, customer ID 4 will not be included as we are missing some data on that one.</p>

In [28]:
# Exercise 2: Left Join (All elements of set on the left)
left_join_result = pd.merge(customers, orders, on='CustomerID', how='left')

left_join_result

   CustomerID     Name                Email  OrderID Product  Quantity
0           1    Alice    alice@example.com    101.0  Widget       3.0
1           1    Alice    alice@example.com    103.0  Widget       5.0
2           2      Bob      bob@example.com    102.0  Gadget       2.0
3           3  Charlie  charlie@example.com    104.0  Widget       4.0
4           4    David    david@example.com      NaN     NaN       NaN

<p style="font-size:14px;">With a "left" join, the NaN data is included as you are merging everything from the left regardless of what is on the right.</p>

In [27]:
# Exercise 3: Right Join (All elements of set on the right)
right_join_result = pd.merge(customers, orders, on='CustomerID', how='right')

right_join_result

   CustomerID     Name                Email  OrderID Product  Quantity
0           1    Alice    alice@example.com      101  Widget         3
1           2      Bob      bob@example.com      102  Gadget         2
2           1    Alice    alice@example.com      103  Widget         5
3           3  Charlie  charlie@example.com      104  Widget         4

<p style="font-size:14px;">With a "right" join, the NaN data is not included as you are merging everything from the right regardless of what is on the left</p>

In [26]:
# Exercise 4: Full Outer Join (Union of 2 sets)
full_outer_join_result = pd.merge(customers, orders, on='CustomerID', how='outer')

full_outer_join_result

   CustomerID     Name                Email  OrderID Product  Quantity
0           1    Alice    alice@example.com    101.0  Widget       3.0
1           1    Alice    alice@example.com    103.0  Widget       5.0
2           2      Bob      bob@example.com    102.0  Gadget       2.0
3           3  Charlie  charlie@example.com    104.0  Widget       4.0
4           4    David    david@example.com      NaN     NaN       NaN

<p style="font-size:14px;">In this case, everything would be shown as a full outer join includes everything from both elements</p>

In [33]:
# Exercise 5: Get Customer ID, Name, Product, and Quantity
test_5 = pd.merge(customers[['CustomerID', 'Name']], orders[['CustomerID', 'Product', 'Quantity']], on='CustomerID', how='outer')

test_5

   CustomerID     Name Product  Quantity
0           1    Alice  Widget       3.0
1           1    Alice  Widget       5.0
2           2      Bob  Gadget       2.0
3           3  Charlie  Widget       4.0
4           4    David     NaN       NaN

<p style="font-size:14px;">In order to merge the common element (CustomerID), you need to specify it twice. You also don't need to specify the 'on' statement or outer.</p>